# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
new_name = " "
for name in names:
    if len(name) > len(new_name):
        new_name = name
print(new_name)
